#include "stdafx.h"
#include "RLogin.h"
#include "MainFrm.h"
#include "RLoginDoc.h"
#include "RLoginView.h"
#include "PassDlg.h"
#include "IdKeyFileDlg.h"
#include "ssh.h"

#include "ssh1.h"
#include "ssh2.h"

#include <io.h>
#include <fcntl.h>
#include <direct.h>
#include <sys/types.h>
#include <sys/stat.h>
#include <sys/utime.h>

#ifdef _DEBUG
#undef THIS_FILE
static char THIS_FILE[]=__FILE__;
#define new DEBUG_NEW
#endif

//////////////////////////////////////////////////////////////////////
// OpenSSH C lib
//////////////////////////////////////////////////////////////////////

#include "openssl/aes.h"
#include "openssl/camellia.h"
#include "openssl/seed.h"
#include "openssl/blowfish.h"
#include "openssl/cast.h"
#include "openssl/idea.h"
#include "openssl/des.h"
#include "openssl/rand.h"

#if	OPENSSL_VERSION_NUMBER >= 0x10100000L
extern "C" {
	#include "internal/evp_int.h"
	#include "internal/chacha.h"
	#include "internal/poly1305.h"
}
#endif

#ifndef _STDINT
typedef unsigned char    uint8_t;
typedef unsigned short   uint16_t;
typedef unsigned long    uint32_t;
typedef unsigned __int64 uint64_t;
typedef          char    int8_t;
typedef          short   int16_t;
typedef          long    int32_t;
typedef          __int64 int64_t;
#endif

#ifdef	USE_NETTLE
	#include "nettle-2.0/twofish.cpp"
	#include "nettle-2.0/serpent.cpp"
#endif

#ifdef	USE_CLEFIA
	#include "nettle-2.0/clefia.cpp"
#endif

#if 0

  fe25519_mul(&t, &t, &num);
  fe25519_mul(&t, &t, &den);
  fe25519_mul(&t, &t, &den);
  fe25519_mul(&r->x, &t, &den);

  /* 3. Check whether sqrt computation gave correct result, multiply by sqrt(-1) if not: */
  fe25519_square(&chk, &r->x);
  fe25519_mul(&chk, &chk, &den);
  if (!fe25519_iseq_vartime(&chk, &num))
    fe25519_mul(&r->x, &r->x, &ge25519_sqrtm1);

  /* 4. Now we have one of the two square roots, except if input was not a square */
  fe25519_square(&chk, &r->x);
  fe25519_mul(&chk, &chk, &den);
  if (!fe25519_iseq_vartime(&chk, &num))
    return -1;

  /* 5. Choose the desired square root according to parity: */
  if(fe25519_getparity(&r->x) != (1-par))
    fe25519_neg(&r->x, &r->x);

  fe25519_mul(&r->t, &r->x, &r->y);
  return 0;
}
static void ge25519_pack(unsigned char r[32], const ge25519 *p)
{
  fe25519 tx, ty, zi;
  fe25519_invert(&zi, &p->z); 
  fe25519_mul(&tx, &p->x, &zi);
  fe25519_mul(&ty, &p->y, &zi);
  fe25519_pack(r, &ty);
  r[31] ^= fe25519_getparity(&tx) << 7;
}
static void ge25519_p1p1_to_p2(ge25519_p2 *r, const ge25519_p1p1 *p)
{
  fe25519_mul(&r->x, &p->x, &p->t);
  fe25519_mul(&r->y, &p->y, &p->z);
  fe25519_mul(&r->z, &p->z, &p->t);
}
static void ge25519_p1p1_to_p3(ge25519 *r, const ge25519_p1p1 *p)
{
  ge25519_p1p1_to_p2((ge25519_p2 *)r, p);
  fe25519_mul(&r->t, &p->x, &p->y);
}
static void ge25519_add_p1p1(ge25519_p1p1 *r, const ge25519 *p, const ge25519 *q)
{
  fe25519 a, b, c, d, t;
  
  fe25519_sub(&a, &p->y, &p->x); /* A = (Y1-X1)*(Y2-X2) */
  fe25519_sub(&t, &q->y, &q->x);
  fe25519_mul(&a, &a, &t);
  fe25519_add(&b, &p->x, &p->y); /* B = (Y1+X1)*(Y2+X2) */
  fe25519_add(&t, &q->x, &q->y);
  fe25519_mul(&b, &b, &t);
  fe25519_mul(&c, &p->t, &q->t); /* C = T1*k*T2 */
  fe25519_mul(&c, &c, &ge25519_ec2d);
  fe25519_mul(&d, &p->z, &q->z); /* D = Z1*2*Z2 */
  fe25519_add(&d, &d, &d);
  fe25519_sub(&r->x, &b, &a); /* E = B-A */
  fe25519_sub(&r->t, &d, &c); /* F = D-C */
  fe25519_add(&r->z, &d, &c); /* G = D+C */
  fe25519_add(&r->y, &b, &a); /* H = B+A */
}
static void ge25519_dbl_p1p1(ge25519_p1p1 *r, const ge25519_p2 *p)
{
  fe25519 a,b,c,d;
  fe25519_square(&a, &p->x);
  fe25519_square(&b, &p->y);
  fe25519_square(&c, &p->z);
  fe25519_add(&c, &c, &c);
  fe25519_neg(&d, &a);

  fe25519_add(&r->x, &p->x, &p->y);
  fe25519_square(&r->x, &r->x);
  fe25519_sub(&r->x, &r->x, &a);
  fe25519_sub(&r->x, &r->x, &b);
  fe25519_add(&r->z, &d, &b);
  fe25519_sub(&r->t, &r->z, &c);
  fe25519_sub(&r->y, &d, &b);
}
static void ge25519_setneutral(ge25519 *r)
{
  fe25519_setzero(&r->x);
  fe25519_setone(&r->y);
  fe25519_setone(&r->z);
  fe25519_setzero(&r->t);
}
static void ge25519_double_scalarmult_vartime(ge25519 *r, const ge25519 *p1, const sc25519 *s1, const ge25519 *p2, const sc25519 *s2)
{
  ge25519_p1p1 tp1p1;
  ge25519 pre[16];
  unsigned char b[127];
  int i;

  /* precomputation							   s2 s1 */
  ge25519_setneutral(pre);							/* 00 00 */
  pre[1] = *p1; 							/* 00 01 */
  ge25519_dbl_p1p1(&tp1p1,(ge25519_p2 *)p1);	  ge25519_p1p1_to_p3( &pre[2], &tp1p1); /* 00 10 */
  ge25519_add_p1p1(&tp1p1,&pre[1], &pre[2]);	  ge25519_p1p1_to_p3( &pre[3], &tp1p1); /* 00 11 */
  pre[4] = *p2; 							/* 01 00 */
  ge25519_add_p1p1(&tp1p1,&pre[1], &pre[4]);	  ge25519_p1p1_to_p3( &pre[5], &tp1p1); /* 01 01 */
  ge25519_add_p1p1(&tp1p1,&pre[2], &pre[4]);	  ge25519_p1p1_to_p3( &pre[6], &tp1p1); /* 01 10 */
  ge25519_add_p1p1(&tp1p1,&pre[3], &pre[4]);	  ge25519_p1p1_to_p3( &pre[7], &tp1p1); /* 01 11 */
  ge25519_dbl_p1p1(&tp1p1,(ge25519_p2 *)p2);	  ge25519_p1p1_to_p3( &pre[8], &tp1p1); /* 10 00 */
  ge25519_add_p1p1(&tp1p1,&pre[1], &pre[8]);	  ge25519_p1p1_to_p3( &pre[9], &tp1p1); /* 10 01 */
  ge25519_dbl_p1p1(&tp1p1,(ge25519_p2 *)&pre[5]); ge25519_p1p1_to_p3(&pre[10], &tp1p1); /* 10 10 */
  ge25519_add_p1p1(&tp1p1,&pre[3], &pre[8]);	  ge25519_p1p1_to_p3(&pre[11], &tp1p1); /* 10 11 */
  ge25519_add_p1p1(&tp1p1,&pre[4], &pre[8]);	  ge25519_p1p1_to_p3(&pre[12], &tp1p1); /* 11 00 */
  ge25519_add_p1p1(&tp1p1,&pre[1],&pre[12]);	  ge25519_p1p1_to_p3(&pre[13], &tp1p1); /* 11 01 */
  ge25519_add_p1p1(&tp1p1,&pre[2],&pre[12]);	  ge25519_p1p1_to_p3(&pre[14], &tp1p1); /* 11 10 */
  ge25519_add_p1p1(&tp1p1,&pre[3],&pre[12]);	  ge25519_p1p1_to_p3(&pre[15], &tp1p1); /* 11 11 */

  sc25519_2interleave2(b,s1,s2);

  /* scalar multiplication */
  *r = pre[b[126]];
  for(i=125;i>=0;i--)
  {
    ge25519_dbl_p1p1(&tp1p1, (ge25519_p2 *)r);
    ge25519_p1p1_to_p2((ge25519_p2 *) r, &tp1p1);
    ge25519_dbl_p1p1(&tp1p1, (ge25519_p2 *)r);
    if(b[i]!=0)
    {
      ge25519_p1p1_to_p3(r, &tp1p1);
      ge25519_add_p1p1(&tp1p1, r, &pre[b[i]]);
    }
    if(i != 0) ge25519_p1p1_to_p2((ge25519_p2 *)r, &tp1p1);
    else ge25519_p1p1_to_p3(r, &tp1p1);
  }
}

//////////////////////////////////////////////////////////////////////
// ed25519.c

/* Public Domain, from supercop-20130419/crypto_sign/ed25519/ref/ed25519.c */

static void get_hram(unsigned char *hram, const unsigned char *sm, const unsigned char *pk, unsigned char *playground, unsigned long long smlen)
{
  unsigned long long i;

  for (i =  0;i < 32;++i)    playground[i] = sm[i];
  for (i = 32;i < 64;++i)    playground[i] = pk[i-32];
